=== Run Tests ===
....FFFFFF                                                               [100%]
================================== FAILURES ===================================
______ test_assert_equal_graph_def_basic_comparison[simple-2-True-True] _______

self = <test_tensorflow_python_framework_test_util_g1.test_assert_equal_graph_def_basic_comparison.<locals>.GraphComparisonTest testMethod=test_graph_comparison>
methodName = 'test_graph_comparison'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
>           testMethod = getattr(self, methodName)
E           AttributeError: 'GraphComparisonTest' object has no attribute 'test_graph_comparison'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:367: AttributeError

During handling of the above exception, another exception occurred:

graph_type = 'simple', node_count = 2, check_version = True, use_mock = True
simple_graph_def = node {
  name: "a"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key...nput: "a"
  input: "b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
versions {
  producer: 987
}

fixed_random_seed = 42

    @pytest.mark.parametrize(
        "graph_type,node_count,check_version,use_mock",
        [
            ("simple", 2, True, True),
            ("complex", 5, False, True),  # 参数扩展
        ]
    )
    def test_assert_equal_graph_def_basic_comparison(graph_type, node_count, check_version, use_mock, simple_graph_def, fixed_random_seed):
        """CASE_03: assert_equal_graph_def 基本比较 - weak 断言"""
    
        # 创建测试类
        class GraphComparisonTest(test_util.TensorFlowTestCase):
            pass
    
>       test_instance = GraphComparisonTest("test_graph_comparison")

tests\test_tensorflow_python_framework_test_util_g1.py:229: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\test_util.py:2314: in __init__
    super(TensorFlowTestCase, self).__init__(methodName)
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\absl\testing\absltest.py:582: in __init__
    super().__init__(*args, **kwargs)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <test_tensorflow_python_framework_test_util_g1.test_assert_equal_graph_def_basic_comparison.<locals>.GraphComparisonTest testMethod=test_graph_comparison>
methodName = 'test_graph_comparison'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
            testMethod = getattr(self, methodName)
        except AttributeError:
            if methodName != 'runTest':
                # we allow instantiation with no explicit method name
                # but not an *incorrect* or missing method name
>               raise ValueError("no such test method in %s: %s" %
                      (self.__class__, methodName))
E               ValueError: no such test method in <class 'test_tensorflow_python_framework_test_util_g1.test_assert_equal_graph_def_basic_comparison.<locals>.GraphComparisonTest'>: test_graph_comparison

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:372: ValueError
_____ test_assert_equal_graph_def_basic_comparison[complex-5-False-True] ______

self = <test_tensorflow_python_framework_test_util_g1.test_assert_equal_graph_def_basic_comparison.<locals>.GraphComparisonTest testMethod=test_graph_comparison>
methodName = 'test_graph_comparison'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
>           testMethod = getattr(self, methodName)
E           AttributeError: 'GraphComparisonTest' object has no attribute 'test_graph_comparison'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:367: AttributeError

During handling of the above exception, another exception occurred:

graph_type = 'complex', node_count = 5, check_version = False, use_mock = True
simple_graph_def = node {
  name: "a"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key...nput: "a"
  input: "b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
versions {
  producer: 987
}

fixed_random_seed = 42

    @pytest.mark.parametrize(
        "graph_type,node_count,check_version,use_mock",
        [
            ("simple", 2, True, True),
            ("complex", 5, False, True),  # 参数扩展
        ]
    )
    def test_assert_equal_graph_def_basic_comparison(graph_type, node_count, check_version, use_mock, simple_graph_def, fixed_random_seed):
        """CASE_03: assert_equal_graph_def 基本比较 - weak 断言"""
    
        # 创建测试类
        class GraphComparisonTest(test_util.TensorFlowTestCase):
            pass
    
>       test_instance = GraphComparisonTest("test_graph_comparison")

tests\test_tensorflow_python_framework_test_util_g1.py:229: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\test_util.py:2314: in __init__
    super(TensorFlowTestCase, self).__init__(methodName)
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\absl\testing\absltest.py:582: in __init__
    super().__init__(*args, **kwargs)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <test_tensorflow_python_framework_test_util_g1.test_assert_equal_graph_def_basic_comparison.<locals>.GraphComparisonTest testMethod=test_graph_comparison>
methodName = 'test_graph_comparison'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
            testMethod = getattr(self, methodName)
        except AttributeError:
            if methodName != 'runTest':
                # we allow instantiation with no explicit method name
                # but not an *incorrect* or missing method name
>               raise ValueError("no such test method in %s: %s" %
                      (self.__class__, methodName))
E               ValueError: no such test method in <class 'test_tensorflow_python_framework_test_util_g1.test_assert_equal_graph_def_basic_comparison.<locals>.GraphComparisonTest'>: test_graph_comparison

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:372: ValueError
_______________ test_gpu_device_name_detection[True-True-True] ________________

self = <test_tensorflow_python_framework_test_util_g1.test_gpu_device_name_detection.<locals>.DeviceDetectionTest testMethod=test_device_detection>
methodName = 'test_device_detection'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
>           testMethod = getattr(self, methodName)
E           AttributeError: 'DeviceDetectionTest' object has no attribute 'test_device_detection'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:367: AttributeError

During handling of the above exception, another exception occurred:

device_present = True, use_mock = True, fallback_cpu = True
fixed_random_seed = 42

    @pytest.mark.parametrize(
        "device_present,use_mock,fallback_cpu",
        [
            (True, True, True),
            (False, True, False),  # 参数扩展
        ]
    )
    def test_gpu_device_name_detection(device_present, use_mock, fallback_cpu, fixed_random_seed):
        """CASE_04: gpu_device_name 设备检测 - weak 断言"""
    
        # 创建测试类
        class DeviceDetectionTest(test_util.TensorFlowTestCase):
            pass
    
>       test_instance = DeviceDetectionTest("test_device_detection")

tests\test_tensorflow_python_framework_test_util_g1.py:351: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\test_util.py:2314: in __init__
    super(TensorFlowTestCase, self).__init__(methodName)
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\absl\testing\absltest.py:582: in __init__
    super().__init__(*args, **kwargs)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <test_tensorflow_python_framework_test_util_g1.test_gpu_device_name_detection.<locals>.DeviceDetectionTest testMethod=test_device_detection>
methodName = 'test_device_detection'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
            testMethod = getattr(self, methodName)
        except AttributeError:
            if methodName != 'runTest':
                # we allow instantiation with no explicit method name
                # but not an *incorrect* or missing method name
>               raise ValueError("no such test method in %s: %s" %
                      (self.__class__, methodName))
E               ValueError: no such test method in <class 'test_tensorflow_python_framework_test_util_g1.test_gpu_device_name_detection.<locals>.DeviceDetectionTest'>: test_device_detection

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:372: ValueError
______________ test_gpu_device_name_detection[False-True-False] _______________

self = <test_tensorflow_python_framework_test_util_g1.test_gpu_device_name_detection.<locals>.DeviceDetectionTest testMethod=test_device_detection>
methodName = 'test_device_detection'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
>           testMethod = getattr(self, methodName)
E           AttributeError: 'DeviceDetectionTest' object has no attribute 'test_device_detection'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:367: AttributeError

During handling of the above exception, another exception occurred:

device_present = False, use_mock = True, fallback_cpu = False
fixed_random_seed = 42

    @pytest.mark.parametrize(
        "device_present,use_mock,fallback_cpu",
        [
            (True, True, True),
            (False, True, False),  # 参数扩展
        ]
    )
    def test_gpu_device_name_detection(device_present, use_mock, fallback_cpu, fixed_random_seed):
        """CASE_04: gpu_device_name 设备检测 - weak 断言"""
    
        # 创建测试类
        class DeviceDetectionTest(test_util.TensorFlowTestCase):
            pass
    
>       test_instance = DeviceDetectionTest("test_device_detection")

tests\test_tensorflow_python_framework_test_util_g1.py:351: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\test_util.py:2314: in __init__
    super(TensorFlowTestCase, self).__init__(methodName)
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\absl\testing\absltest.py:582: in __init__
    super().__init__(*args, **kwargs)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <test_tensorflow_python_framework_test_util_g1.test_gpu_device_name_detection.<locals>.DeviceDetectionTest testMethod=test_device_detection>
methodName = 'test_device_detection'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
            testMethod = getattr(self, methodName)
        except AttributeError:
            if methodName != 'runTest':
                # we allow instantiation with no explicit method name
                # but not an *incorrect* or missing method name
>               raise ValueError("no such test method in %s: %s" %
                      (self.__class__, methodName))
E               ValueError: no such test method in <class 'test_tensorflow_python_framework_test_util_g1.test_gpu_device_name_detection.<locals>.DeviceDetectionTest'>: test_device_detection

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:372: ValueError
_____________ test_create_local_cluster_basic_creation[2-1-True] ______________

self = <test_tensorflow_python_framework_test_util_g1.test_create_local_cluster_basic_creation.<locals>.ClusterCreationTest testMethod=test_cluster_creation>
methodName = 'test_cluster_creation'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
>           testMethod = getattr(self, methodName)
E           AttributeError: 'ClusterCreationTest' object has no attribute 'test_cluster_creation'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:367: AttributeError

During handling of the above exception, another exception occurred:

worker_count = 2, ps_count = 1, use_mock = True, fixed_random_seed = 42

    @pytest.mark.parametrize(
        "worker_count,ps_count,use_mock",
        [
            (2, 1, True),
            (1, 0, True),  # 参数扩展
        ]
    )
    def test_create_local_cluster_basic_creation(worker_count, ps_count, use_mock, fixed_random_seed):
        """CASE_05: create_local_cluster 基本创建 - weak 断言"""
    
        # 创建测试类
        class ClusterCreationTest(test_util.TensorFlowTestCase):
            pass
    
>       test_instance = ClusterCreationTest("test_cluster_creation")

tests\test_tensorflow_python_framework_test_util_g1.py:449: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\test_util.py:2314: in __init__
    super(TensorFlowTestCase, self).__init__(methodName)
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\absl\testing\absltest.py:582: in __init__
    super().__init__(*args, **kwargs)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <test_tensorflow_python_framework_test_util_g1.test_create_local_cluster_basic_creation.<locals>.ClusterCreationTest testMethod=test_cluster_creation>
methodName = 'test_cluster_creation'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
            testMethod = getattr(self, methodName)
        except AttributeError:
            if methodName != 'runTest':
                # we allow instantiation with no explicit method name
                # but not an *incorrect* or missing method name
>               raise ValueError("no such test method in %s: %s" %
                      (self.__class__, methodName))
E               ValueError: no such test method in <class 'test_tensorflow_python_framework_test_util_g1.test_create_local_cluster_basic_creation.<locals>.ClusterCreationTest'>: test_cluster_creation

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:372: ValueError
_____________ test_create_local_cluster_basic_creation[1-0-True] ______________

self = <test_tensorflow_python_framework_test_util_g1.test_create_local_cluster_basic_creation.<locals>.ClusterCreationTest testMethod=test_cluster_creation>
methodName = 'test_cluster_creation'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
>           testMethod = getattr(self, methodName)
E           AttributeError: 'ClusterCreationTest' object has no attribute 'test_cluster_creation'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:367: AttributeError

During handling of the above exception, another exception occurred:

worker_count = 1, ps_count = 0, use_mock = True, fixed_random_seed = 42

    @pytest.mark.parametrize(
        "worker_count,ps_count,use_mock",
        [
            (2, 1, True),
            (1, 0, True),  # 参数扩展
        ]
    )
    def test_create_local_cluster_basic_creation(worker_count, ps_count, use_mock, fixed_random_seed):
        """CASE_05: create_local_cluster 基本创建 - weak 断言"""
    
        # 创建测试类
        class ClusterCreationTest(test_util.TensorFlowTestCase):
            pass
    
>       test_instance = ClusterCreationTest("test_cluster_creation")

tests\test_tensorflow_python_framework_test_util_g1.py:449: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\test_util.py:2314: in __init__
    super(TensorFlowTestCase, self).__init__(methodName)
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\absl\testing\absltest.py:582: in __init__
    super().__init__(*args, **kwargs)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <test_tensorflow_python_framework_test_util_g1.test_create_local_cluster_basic_creation.<locals>.ClusterCreationTest testMethod=test_cluster_creation>
methodName = 'test_cluster_creation'

    def __init__(self, methodName='runTest'):
        """Create an instance of the class that will use the named test
           method when executed. Raises a ValueError if the instance does
           not have a method with the specified name.
        """
        self._testMethodName = methodName
        self._outcome = None
        self._testMethodDoc = 'No test'
        try:
            testMethod = getattr(self, methodName)
        except AttributeError:
            if methodName != 'runTest':
                # we allow instantiation with no explicit method name
                # but not an *incorrect* or missing method name
>               raise ValueError("no such test method in %s: %s" %
                      (self.__class__, methodName))
E               ValueError: no such test method in <class 'test_tensorflow_python_framework_test_util_g1.test_create_local_cluster_basic_creation.<locals>.ClusterCreationTest'>: test_cluster_creation

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\case.py:372: ValueError

---------- coverage: platform win32, python 3.9.25-final-0 -----------
Name                                                     Stmts   Miss Branch BrPart  Cover   Missing
----------------------------------------------------------------------------------------------------
tests\test_tensorflow_python_framework_test_util_g1.py     294    176     58      1    37%   48-53, 57-61, 199->205, 232-333, 354-431, 452-576
----------------------------------------------------------------------------------------------------
TOTAL                                                      294    176     58      1    37%
Coverage XML written to file coverage.xml

=========================== short test summary info ===========================
FAILED tests\test_tensorflow_python_framework_test_util_g1.py::test_assert_equal_graph_def_basic_comparison[simple-2-True-True]
FAILED tests\test_tensorflow_python_framework_test_util_g1.py::test_assert_equal_graph_def_basic_comparison[complex-5-False-True]
FAILED tests\test_tensorflow_python_framework_test_util_g1.py::test_gpu_device_name_detection[True-True-True]
FAILED tests\test_tensorflow_python_framework_test_util_g1.py::test_gpu_device_name_detection[False-True-False]
FAILED tests\test_tensorflow_python_framework_test_util_g1.py::test_create_local_cluster_basic_creation[2-1-True]
FAILED tests\test_tensorflow_python_framework_test_util_g1.py::test_create_local_cluster_basic_creation[1-0-True]
6 failed, 4 passed in 2.04s

Error: exit 1