=== Run Tests ===
EEE...                                                                   [100%]
=================================== ERRORS ====================================
_ ERROR at setup of TestMLIRModuleG1.test_convert_graph_def_basic_conversion[simple_graph-tf-standard-pipeline-False-module {\n  func.func @main() -> tensor<f32> {\n    %0 = "tf.Const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>\n    return %0 : tensor<f32>\n  }\n}\n] _

    @pytest.fixture
    def text_proto_graph_def():
        """Create a GraphDef from text proto for testing."""
        text_proto = """
        node {
          name: "const"
          op: "Const"
          attr {
            key: "dtype"
            value {
              type: DT_FLOAT
            }
          }
          attr {
            key: "value"
            value {
              tensor {
                dtype: DT_FLOAT
                tensor_shape {
                }
                float_val: 5.0
              }
            }
          }
        }
        """
        graph_def = tf.compat.v1.GraphDef()
>       tf.compat.v1.text_format.Parse(text_proto, graph_def)
E       AttributeError: module 'tensorflow.compat.v1' has no attribute 'text_format'

tests\test_tensorflow_python_compiler_mlir_mlir_g1.py:91: AttributeError
_ ERROR at setup of TestMLIRModuleG1.test_convert_graph_def_basic_conversion[complex_graph-tf-standard-pipeline-False-module {\n  func.func @main() -> tensor<3xf32> {\n    %0 = "tf.Const"() {value = dense<[1.000000e+00, 2.000000e+00, 3.000000e+00]> : tensor<3xf32>} : () -> tensor<3xf32>\n    %1 = "tf.Add"(%0, %0) : (tensor<3xf32>, tensor<3xf32>) -> tensor<3xf32>\n    return %1 : tensor<3xf32>\n  }\n}\n] _

    @pytest.fixture
    def text_proto_graph_def():
        """Create a GraphDef from text proto for testing."""
        text_proto = """
        node {
          name: "const"
          op: "Const"
          attr {
            key: "dtype"
            value {
              type: DT_FLOAT
            }
          }
          attr {
            key: "value"
            value {
              tensor {
                dtype: DT_FLOAT
                tensor_shape {
                }
                float_val: 5.0
              }
            }
          }
        }
        """
        graph_def = tf.compat.v1.GraphDef()
>       tf.compat.v1.text_format.Parse(text_proto, graph_def)
E       AttributeError: module 'tensorflow.compat.v1' has no attribute 'text_format'

tests\test_tensorflow_python_compiler_mlir_mlir_g1.py:91: AttributeError
_ ERROR at setup of TestMLIRModuleG1.test_convert_graph_def_basic_conversion[text_proto-tf-standard-pipeline-False-module {\n  func.func @main() -> tensor<f32> {\n    %0 = "tf.Const"() {value = dense<5.000000e+00> : tensor<f32>} : () -> tensor<f32>\n    return %0 : tensor<f32>\n  }\n}\n] _

    @pytest.fixture
    def text_proto_graph_def():
        """Create a GraphDef from text proto for testing."""
        text_proto = """
        node {
          name: "const"
          op: "Const"
          attr {
            key: "dtype"
            value {
              type: DT_FLOAT
            }
          }
          attr {
            key: "value"
            value {
              tensor {
                dtype: DT_FLOAT
                tensor_shape {
                }
                float_val: 5.0
              }
            }
          }
        }
        """
        graph_def = tf.compat.v1.GraphDef()
>       tf.compat.v1.text_format.Parse(text_proto, graph_def)
E       AttributeError: module 'tensorflow.compat.v1' has no attribute 'text_format'

tests\test_tensorflow_python_compiler_mlir_mlir_g1.py:91: AttributeError

---------- coverage: platform win32, python 3.9.25-final-0 -----------
Name                                                    Stmts   Miss Branch BrPart  Cover   Missing
---------------------------------------------------------------------------------------------------
tests\test_tensorflow_python_compiler_mlir_mlir_g1.py      87     14      8      1    78%   92, 148-184, 230->238
---------------------------------------------------------------------------------------------------
TOTAL                                                      87     14      8      1    78%
Coverage XML written to file coverage.xml

=========================== short test summary info ===========================
ERROR tests\test_tensorflow_python_compiler_mlir_mlir_g1.py::TestMLIRModuleG1::test_convert_graph_def_basic_conversion[simple_graph-tf-standard-pipeline-False-module {\n  func.func @main() -> tensor<f32> {\n    %0 = "tf.Const"() {value = dense<1.000000e+00> : tensor<f32>} : () -> tensor<f32>\n    return %0 : tensor<f32>\n  }\n}\n]
ERROR tests\test_tensorflow_python_compiler_mlir_mlir_g1.py::TestMLIRModuleG1::test_convert_graph_def_basic_conversion[complex_graph-tf-standard-pipeline-False-module {\n  func.func @main() -> tensor<3xf32> {\n    %0 = "tf.Const"() {value = dense<[1.000000e+00, 2.000000e+00, 3.000000e+00]> : tensor<3xf32>} : () -> tensor<3xf32>\n    %1 = "tf.Add"(%0, %0) : (tensor<3xf32>, tensor<3xf32>) -> tensor<3xf32>\n    return %1 : tensor<3xf32>\n  }\n}\n]
ERROR tests\test_tensorflow_python_compiler_mlir_mlir_g1.py::TestMLIRModuleG1::test_convert_graph_def_basic_conversion[text_proto-tf-standard-pipeline-False-module {\n  func.func @main() -> tensor<f32> {\n    %0 = "tf.Const"() {value = dense<5.000000e+00> : tensor<f32>} : () -> tensor<f32>\n    return %0 : tensor<f32>\n  }\n}\n]
3 passed, 3 errors in 1.89s

Error: exit 1