=== Run Tests ===
FFFFF.FF                                                                 [100%]
================================== FAILURES ===================================
_______________ test_write_graph_graph_to_text_file[small-True] _______________

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1226: AttributeError

During handling of the above exception, another exception occurred:

temp_dir = 'C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\tmplv84jnv8'
small_graph = <tensorflow.python.framework.ops.Graph object at 0x000001EC0C574220>
graph_size = 'small', as_text_value = True

    @pytest.mark.parametrize(
        "graph_size,as_text_value",
        [
            ("small", True),
        ]
    )
    def test_write_graph_graph_to_text_file(temp_dir, small_graph, graph_size, as_text_value):
        """TC-01: Graph对象写入文本格式文件
    
        Weak assertions:
        - file_exists: 文件应该被创建
        - path_returned: 函数应该返回正确的文件路径
        - file_not_empty: 文件不应该为空
        - basic_content: 文件应该包含基本的图结构信息
        """
        # Arrange
        logdir = temp_dir
        filename = "graph.pbtxt"
        expected_path = os.path.join(logdir, filename)
    
        # Act
>       with mock.patch('tensorflow.python.lib.io.file_io.atomic_write_string_to_file') as mock_write:

tests\test_tensorflow_python_framework_graph_io.py:64: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1388: in __enter__
    self.target = self.getter()
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1563: in <lambda>
    getter = lambda: _importer(target)
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1239: in _importer
    thing = _dot_lookup(thing, comp, import_path)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
            return getattr(thing, comp)
        except AttributeError:
            __import__(import_path)
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1229: AttributeError
____________ test_write_graph_graphdef_to_binary_file[small-False] ____________

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1226: AttributeError

During handling of the above exception, another exception occurred:

temp_dir = 'C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\tmpg2vd1ca_'
small_graph_def = node {
  name: "a"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key...nput: "a"
  input: "b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
versions {
  producer: 987
}

graph_size = 'small', as_text_value = False

    @pytest.mark.parametrize(
        "graph_size,as_text_value",
        [
            ("small", False),
        ]
    )
    def test_write_graph_graphdef_to_binary_file(temp_dir, small_graph_def, graph_size, as_text_value):
        """TC-02: GraphDef对象写入二进制格式文件
    
        Weak assertions:
        - file_exists: 文件应该被创建
        - path_returned: 函数应该返回正确的文件路径
        - file_not_empty: 文件不应该为空
        - binary_format: 应该以二进制格式写入
        """
        # Arrange
        logdir = temp_dir
        filename = "graph.pb"
        expected_path = os.path.join(logdir, filename)
    
        # Act
>       with mock.patch('tensorflow.python.lib.io.file_io.atomic_write_string_to_file') as mock_write:

tests\test_tensorflow_python_framework_graph_io.py:121: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1388: in __enter__
    self.target = self.getter()
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1563: in <lambda>
    getter = lambda: _importer(target)
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1239: in _importer
    thing = _dot_lookup(thing, comp, import_path)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
            return getattr(thing, comp)
        except AttributeError:
            __import__(import_path)
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1229: AttributeError
_ test_write_graph_invalid_input_types[invalid_string-TypeError-/tmp/test_dir-test.pbtxt-True] _

temp_dir = 'C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\tmp5faxqjpp'
invalid_input = 'invalid_string', expected_error_type = <class 'TypeError'>
logdir = '/tmp/test_dir', name = 'test.pbtxt', as_text_value = True

    @pytest.mark.parametrize(
        "invalid_input,expected_error_type,logdir,name,as_text_value",
        [
            ("invalid_string", TypeError, "/tmp/test_dir", "test.pbtxt", True),
            (None, TypeError, "/tmp/test_dir", "test.pbtxt", True),
        ]
    )
    def test_write_graph_invalid_input_types(temp_dir, invalid_input, expected_error_type, logdir, name, as_text_value):
        """TC-03: 无效输入类型异常触发
    
        Weak assertions:
        - exception_raised: 应该抛出异常
        - exception_type: 异常类型应该是TypeError
        - error_message_contains: 错误信息应该包含相关提示
        """
        # Arrange
        # 对于字符串输入，直接使用参数
        if invalid_input == "invalid_string":
            test_input = "not_a_graph"
        else:
            test_input = invalid_input
    
        # Act & Assert
        with pytest.raises(expected_error_type) as exc_info:
>           graph_io.write_graph(
                graph_or_graph_def=test_input,
                logdir=logdir,
                name=name,
                as_text=as_text_value
            )

tests\test_tensorflow_python_framework_graph_io.py:184: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\graph_io.py:67: in write_graph
    text_format.MessageToString(
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\google\protobuf\text_format.py:187: in MessageToString
    printer.PrintMessage(message)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <google.protobuf.text_format._Printer object at 0x000001EC0C706250>
message = 'not_a_graph'

    def PrintMessage(self, message):
      """Convert protobuf message to text format.
    
      Args:
        message: The protocol buffers message.
      """
      if self.message_formatter and self._TryCustomFormatMessage(message):
        return
>     if (message.DESCRIPTOR.full_name == _ANY_FULL_TYPE_NAME and
          self._TryPrintAsAnyMessage(message)):
E         AttributeError: 'str' object has no attribute 'DESCRIPTOR'

D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\google\protobuf\text_format.py:428: AttributeError
_ test_write_graph_invalid_input_types[None-TypeError-/tmp/test_dir-test.pbtxt-True] _

temp_dir = 'C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\tmpu_5idtgf'
invalid_input = None, expected_error_type = <class 'TypeError'>
logdir = '/tmp/test_dir', name = 'test.pbtxt', as_text_value = True

    @pytest.mark.parametrize(
        "invalid_input,expected_error_type,logdir,name,as_text_value",
        [
            ("invalid_string", TypeError, "/tmp/test_dir", "test.pbtxt", True),
            (None, TypeError, "/tmp/test_dir", "test.pbtxt", True),
        ]
    )
    def test_write_graph_invalid_input_types(temp_dir, invalid_input, expected_error_type, logdir, name, as_text_value):
        """TC-03: 无效输入类型异常触发
    
        Weak assertions:
        - exception_raised: 应该抛出异常
        - exception_type: 异常类型应该是TypeError
        - error_message_contains: 错误信息应该包含相关提示
        """
        # Arrange
        # 对于字符串输入，直接使用参数
        if invalid_input == "invalid_string":
            test_input = "not_a_graph"
        else:
            test_input = invalid_input
    
        # Act & Assert
        with pytest.raises(expected_error_type) as exc_info:
>           graph_io.write_graph(
                graph_or_graph_def=test_input,
                logdir=logdir,
                name=name,
                as_text=as_text_value
            )

tests\test_tensorflow_python_framework_graph_io.py:184: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\tensorflow\python\framework\graph_io.py:67: in write_graph
    text_format.MessageToString(
D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\google\protobuf\text_format.py:187: in MessageToString
    printer.PrintMessage(message)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

self = <google.protobuf.text_format._Printer object at 0x000001EC0D73D340>
message = None

    def PrintMessage(self, message):
      """Convert protobuf message to text format.
    
      Args:
        message: The protocol buffers message.
      """
      if self.message_formatter and self._TryCustomFormatMessage(message):
        return
>     if (message.DESCRIPTOR.full_name == _ANY_FULL_TYPE_NAME and
          self._TryPrintAsAnyMessage(message)):
E         AttributeError: 'NoneType' object has no attribute 'DESCRIPTOR'

D:\Coding\Anaconda\envs\testagent-experiment\lib\site-packages\google\protobuf\text_format.py:428: AttributeError
___________________ test_write_graph_auto_create_directory ____________________

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1226: AttributeError

During handling of the above exception, another exception occurred:

temp_dir = 'C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\tmpq04yi916'
small_graph = <tensorflow.python.framework.ops.Graph object at 0x000001EC0D85EE20>

    def test_write_graph_auto_create_directory(temp_dir, small_graph):
        """TC-04: 本地目录自动创建功能
    
        Weak assertions:
        - directory_created: 目录应该被创建
        - file_exists: 文件应该被创建
        - path_returned: 函数应该返回正确的文件路径
        """
        # Arrange
        # 创建一个不存在的子目录
        non_existent_dir = os.path.join(temp_dir, "nonexistent_subdir")
        filename = "test.pbtxt"
        expected_path = os.path.join(non_existent_dir, filename)
    
        # 确保目录不存在
        assert not os.path.exists(non_existent_dir), "测试目录不应该预先存在"
    
        # Act
>       with mock.patch('tensorflow.python.lib.io.file_io.atomic_write_string_to_file') as mock_write:

tests\test_tensorflow_python_framework_graph_io.py:233: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1388: in __enter__
    self.target = self.getter()
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1563: in <lambda>
    getter = lambda: _importer(target)
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1239: in _importer
    thing = _dot_lookup(thing, comp, import_path)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
            return getattr(thing, comp)
        except AttributeError:
            __import__(import_path)
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1229: AttributeError
______________________ test_write_graph_default_as_text _______________________

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1226: AttributeError

During handling of the above exception, another exception occurred:

temp_dir = 'C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\tmpbp_fvfmc'
small_graph = <tensorflow.python.framework.ops.Graph object at 0x000001EC0C53C910>

    def test_write_graph_default_as_text(temp_dir, small_graph):
        """Test that as_text defaults to True."""
        # Arrange
        logdir = temp_dir
        filename = "default_test.pbtxt"
    
        # Act
>       with mock.patch('tensorflow.python.lib.io.file_io.atomic_write_string_to_file') as mock_write:

tests\test_tensorflow_python_framework_graph_io.py:297: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1388: in __enter__
    self.target = self.getter()
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1563: in <lambda>
    getter = lambda: _importer(target)
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1239: in _importer
    thing = _dot_lookup(thing, comp, import_path)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
            return getattr(thing, comp)
        except AttributeError:
            __import__(import_path)
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1229: AttributeError
_______________ test_write_graph_gcs_path_no_directory_creation _______________

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1226: AttributeError

During handling of the above exception, another exception occurred:

temp_dir = 'C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\tmpiyja6cds'
small_graph = <tensorflow.python.framework.ops.Graph object at 0x000001EC0C564CA0>

    def test_write_graph_gcs_path_no_directory_creation(temp_dir, small_graph):
        """Test that GCS paths don't trigger directory creation."""
        # Arrange
        gcs_path = "gs://test-bucket/path"
        filename = "test.pbtxt"
    
        # Act
>       with mock.patch('tensorflow.python.lib.io.file_io.atomic_write_string_to_file') as mock_write:

tests\test_tensorflow_python_framework_graph_io.py:323: 
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1388: in __enter__
    self.target = self.getter()
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1563: in <lambda>
    getter = lambda: _importer(target)
D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1239: in _importer
    thing = _dot_lookup(thing, comp, import_path)
_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

thing = <module 'tensorflow' from 'D:\\Coding\\Anaconda\\envs\\testagent-experiment\\lib\\site-packages\\tensorflow\\__init__.py'>
comp = 'python', import_path = 'tensorflow.python'

    def _dot_lookup(thing, comp, import_path):
        try:
            return getattr(thing, comp)
        except AttributeError:
            __import__(import_path)
>           return getattr(thing, comp)
E           AttributeError: module 'tensorflow' has no attribute 'python'

D:\Coding\Anaconda\envs\testagent-experiment\lib\unittest\mock.py:1229: AttributeError

---------- coverage: platform win32, python 3.9.25-final-0 -----------
Name                                                 Stmts   Miss Branch BrPart  Cover   Missing
------------------------------------------------------------------------------------------------
tests\test_tensorflow_python_framework_graph_io.py     122     56      8      0    52%   65-96, 122-153, 193-207, 234-259, 298-314, 324-342
------------------------------------------------------------------------------------------------
TOTAL                                                  122     56      8      0    52%
Coverage XML written to file coverage.xml

=========================== short test summary info ===========================
FAILED tests\test_tensorflow_python_framework_graph_io.py::test_write_graph_graph_to_text_file[small-True]
FAILED tests\test_tensorflow_python_framework_graph_io.py::test_write_graph_graphdef_to_binary_file[small-False]
FAILED tests\test_tensorflow_python_framework_graph_io.py::test_write_graph_invalid_input_types[invalid_string-TypeError-/tmp/test_dir-test.pbtxt-True]
FAILED tests\test_tensorflow_python_framework_graph_io.py::test_write_graph_invalid_input_types[None-TypeError-/tmp/test_dir-test.pbtxt-True]
FAILED tests\test_tensorflow_python_framework_graph_io.py::test_write_graph_auto_create_directory
FAILED tests\test_tensorflow_python_framework_graph_io.py::test_write_graph_default_as_text
FAILED tests\test_tensorflow_python_framework_graph_io.py::test_write_graph_gcs_path_no_directory_creation
7 failed, 1 passed in 2.05s

Error: exit 1